РП/src/DataProcessors/НастройкаПередачиМатериаловВПроизводство/НастройкаПередачиМатериаловВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаПередачиМатериаловВПроизводство</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементГруппа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеДляПолучения</name>
      <type>
        <types>EnumRef.ОснованияДляПолученияМатериаловВПроизводстве</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикиИспользуются</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособНастройки</name>
      <type>
        <types>EnumRef.СпособыНастройкиПередачиМатериаловВПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНастройкаДляНоменклатуры</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаХарактеристики</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

РП/src/Enums/СпособыНастройкиПередачиМатериаловВПроизводство/СпособыНастройкиПередачиМатериаловВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНастройкиПередачиМатериаловВПроизводство</name>
  <enumValues>
    <name>ОпределяетсяНастройкойДляПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяНастройкойДляНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>НастраиваетсяИндивидуально</name>
  </enumValues>
</mdclass:Enum>

РП/src/DataProcessors/НастройкаПередачиМатериаловВПроизводство/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Склад");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ОснованиеДляПолучения");
	
	ШаблонСообщенияСклад     = НСтр("ru='Не заполнена колонка ""Склад"" в строке %1.';uk='Не заповнена колонка ""Склад"" в рядку %1.'");
	ШаблонСообщенияОснование = НСтр("ru='Не заполнена колонка ""Основание для получения"" в строке %1.';uk='Не заповнена колонка ""Підстава для отримання"" в рядку %1.'");
	Для каждого ДанныеСтроки Из Товары Цикл
		
		Если ДанныеСтроки.СпособНастройки <> Перечисления.СпособыНастройкиПередачиМатериаловВПроизводство.НастраиваетсяИндивидуально Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Склад) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщенияСклад, ДанныеСтроки.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ДанныеСтроки.НомерСтроки, "Склад");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ОснованиеДляПолучения) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщенияОснование, ДанныеСтроки.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ДанныеСтроки.НомерСтроки, "ОснованиеДляПолучения");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		КонецЕсли; 
		
	КонецЦикла; 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
